{"/about/":{"data":{"":"This is the about me page."},"title":"About"},"/docs/":{"data":{"":"","hello-world#Hello, World!":"This is a demo of the theme’s documentation layout.\nHello, World! main.gopackage main import \"fmt\" func main() { fmt.Println(\"Hello, World!\") } "},"title":"Documentation"},"/docs/class-12-computer-science/":{"data":{"":"This page will cover all the chapter’s summary of NCERT class 12 computer science"},"title":"Class 12 Computer Science"},"/docs/class-12-computer-science/chapter_1/":{"data":{"":"place holder for CS"},"title":"Chapter_1"},"/docs/class-12-english-summary/":{"data":{"":"This page will cover all the chapter’s summary of NCERT class 12 english"},"title":"Class 12 English Summary"},"/docs/class-12-english-summary/keeping_quite/":{"data":{"k#K":"K"},"title":"Keeping Quite"},"/docs/class-12-english-summary/my_mother_at_sixty_six/":{"data":{"my-mother-at-sisty-six#My Mother at Sisty-Six":"","poetic-devices#Poetic Devices":"My Mother at Sisty-SixThe poem “My Mother at Sixty-Six” talks about the poet’s feelings when she sees her mother growing old. It shows her love for her mother and her fear of losing her.\nSummaryThe poet describes a car ride with her mother, who is sitting beside her. She notices her mother’s pale and tired face, which reminds her of an old, lifeless winter moon. This makes the poet sad as she realizes her mother is aging and might not live forever.\nTo avoid thinking about this, the poet looks out of the car window. She sees lively scenes like children playing and trees rushing by, which are full of energy and life, unlike her mother, who looks weak and quiet.\nAt the airport, as she says goodbye to her mother, the poet notices her pale face again. Even though she feels very emotional, she hides her sadness, smiles, and tells her mother they will meet again. Inside, however, she is deeply worried and upset about leaving her aging mother.\nThemes Aging and Fear of Loss: The poem shows the poet’s fear of losing her mother as she grows older.\nLove and Bond: It reflects the strong love between the poet and her mother.\nLife and Change: The poet compares the lively scenes outside to her mother’s old age, showing the difference between youth and aging.\nPoetic Devices Simile\nDefinition: A comparison using “like” or “as.”\nExample:\n“Her face ashen like that of a corpse”\nThe poet compares her mother’s pale face to a dead body to emphasize her aging and frailty. “Pale as a late winter’s moon”\nThe mother’s face is compared to a dim, fading winter moon to show her weak and lifeless appearance. Imagery\nDefinition: Use of descriptive language to create visual pictures in the reader’s mind.\nExample\n“Trees sprinting, the merry children spilling out of their homes”\nVivid imagery is used to describe the energy and liveliness outside, contrasting with the poet’s mother’s stillness. Repetition\nDefinition: Repeating words or phrases for emphasis.\nExample\n“Smile and smile and smile…”\nThe repetition of “smile” highlights the poet’s effort to hide her pain and reassure her mother. ","summary#Summary":"","themes#Themes":""},"title":"My Mother At Sixty-Six"}}